#!/usr/bin/env python
# -*- coding: utf-8 -*-
# ************************************************************************
# * Software:  DataInput  for  Python                                    *
# * Version:  1.0.1                                                      *
# * Date:  2023-05-15 00:00:00                                           *
# * Last  update: 2023-03-30 00:00:00                                    *
# * License:  LGPL v1.0                                                  *
# * Maintain  address:  https://pan.baidu.com/s/1SKx3np-9jii3Zgf1joAO4A  *
# * Maintain  code:  STBM                                                *
# ************************************************************************

import time
import pandas as pd
from pandas import DataFrame
import urllib.request
import json
from PyQt5.QtCore import QTimer, QCoreApplication
from PyQt5.QtWidgets import QApplication
import os


class DataInput(object):
    """数据输入"""

    def __init__(self):
        """初始化各参量"""
        self.YS_Resource = 'D:\\YStest'
        self.YS_csv_list, self.YS_csv_num, self.YS_csv_col = None, 0, 0
        self.Key_YS = {'桩号': '里程', '运行时间': '运行时间', '刀盘转速': '刀盘转速', '刀盘给定转速显示值': '刀盘转速设定值',
                       '推进速度': '推进速度', '推进速度给定百分比': '推进速度设定值', '总推进力': '刀盘推力',
                       '刀盘扭矩': '刀盘扭矩', '贯入度': '刀盘贯入度', '推进位移': '推进位移', '推进压力': '推进压力',
                       '顶护盾压力': '顶护盾压力', '左侧护盾压力': '左侧护盾压力', '右侧护盾压力': '右侧护盾压力', '顶护盾位移': '顶护盾位移',
                       '左侧护盾位移': '左侧护盾位移', '右侧护盾位移': '右侧护盾位移', '撑靴压力': '撑紧压力',
                       '左撑靴油缸行程检测': '左撑靴位移', '右撑靴油缸行程检测': '右撑靴位移', '冷水泵压力': '冷水泵压力',
                       '控制泵压力': '控制泵压力', '主机皮带机转速': '主机皮带机速度', '推进泵电机电流': '推进泵电机电流'}
        self.YC_Resource = 'C:\\YCtest'
        self.YC_csv_list, self.YC_csv_num, self.YC_csv_col = None, 0, 0
        self.Key_YC = {'导向盾首里程': '里程', '日期': '运行时间', '刀盘转速': '刀盘转速', '刀盘给定转速': '刀盘转速设定值',
                       '推进速度(nn/M)': '推进速度', '推进给定速度': '推进速度设定值', '总推力': '刀盘推力', '刀盘扭矩': '刀盘扭矩',
                       '刀盘贯入度': '刀盘贯入度', '推进位移': '推进位移', '推进压力': '推进压力', '顶护盾压力': '顶护盾压力',
                       '左侧护盾压力': '左侧护盾压力', '右侧护盾压力': '右侧护盾压力', '顶护盾位移': '顶护盾位移',
                       '左侧护盾位移': '左侧护盾位移', '右侧护盾位移': '右侧护盾位移', '撑紧压力': '撑紧压力',
                       '左撑靴位移': '左撑靴位移', '右撑靴位移': '右撑靴位移', '冷水泵压力': '冷水泵压力',
                       '控制泵压力': '控制泵压力', '主机皮带机速度': '主机皮带机速度', '推进泵电机电流': '推进泵电机电流'}
        self.PLC_Simulate_URL = 'http://192.168.1.108:8800/api/realtime?id=3'
        self.Key_Simulate = {'time_str': '运行时间', 'db47_16': '导向盾首里程', 'db973_308': '围岩等级', 'db40_1330': '刀盘转速',
                             'db40_1514': '刀盘给定转速',  'db40_2138': '推进速度(nn/M)', 'db40_2262': '推进给定速度',
                             'db40_1346': '刀盘扭矩', 'db40_2134': '总推力', 'db40_1518': '刀盘贯入度', 'db40_2142': '推进位移',
                             'db40_2130': '推进压力', 'db40_230': '日进尺', 'db40_234': '本月进尺', 'db40_238': '上月进尺',
                             'db40_242': '开累进尺', 'db40_246': '隧道总长度', 'db40_250': '完成百分比', 'db40_530': '内循环水罐进口水温度',
                             'db40_534': '内循环水出口温度', 'db40_538': '冷水箱温度', 'db40_542': '冷水箱液位', 'db40_546': '暖水箱温度',
                             'db40_550': '暖水箱液位', 'db40_562': '水系统进水流量', 'db40_566': '液压油箱温度', 'db40_570': '进水温度',
                             'db40_574': '冷水泵出口水温度', 'db40_582': '水系统进水压力', 'db40_586': '污水箱液位', 'db40_590': '减速机进水压力',
                             'db40_594': '减速机回水温度', 'db40_598': '护盾喷水压力', 'db40_602': '刀盘喷水压力', 'db40_610': '减速机冷却水出口流量',
                             'db40_614': '锚杆钻机冷却冲洗泵压力', 'db40_650': '备用水泵压力', 'db40_654': '冷水泵压力',
                             'db40_658': '内循环水泵出口压力', 'db40_670': '刀盘喷水泵压力', 'db40_718': '二次风机2电机电流',
                             'db40_722': '二次风机1电机电流', 'db40_930': '齿轮油箱温度', 'db40_934': '回油泵进口温度',
                             'db40_954': 'EP2出口压力', 'db40_958': '油脂泵出口压力', 'db40_962': 'EP2次数', 'db40_966': '内密封前腔压力',
                             'db40_970': '外密封迷宫腔压力', 'db40_974': '外密封前腔压力', 'db40_978': '内密封迷宫腔压力',
                             'db40_982': '内密封前腔注脂频率', 'db40_986': '外密封迷宫腔注脂频率', 'db40_990': '外密封前腔注脂频率',
                             'db40_1002': '齿轮油泵1压力', 'db40_1006': '齿轮油泵2压力', 'db40_1010': '齿轮油泵3压力',
                             'db40_1026': '回油泵压力', 'db40_1050': '润滑泵电机电流', 'db40_1054': '推进油缸前部铰接',
                             'db40_1058': '推进油缸后部铰接', 'db40_1062': '撑靴球头滑轨', 'db40_1066': '推进右后及行走轨润滑注脂频率',
                             'db40_1070': '扭矩油缸铰接润滑注脂频率', 'db40_1078': '小齿轮润滑', 'db40_1082': '小轴承润滑',
                             'db40_1086': '主轴承润滑1', 'db40_1090': '主轴承润滑2', 'db40_1118': '提升油缸十字铰接次数',
                             'db40_1122': '护盾铰接次数', 'db40_1246': '喷浆泵压力', 'db40_1250': '机械手泵电机电流',
                             'db40_1342': '刹车释放压力', 'db40_1422': '刀盘运行时间小时', 'db40_1426': '刀盘运行时间分钟',
                             'db40_1430': '变频柜内水温度', 'db40_1434': '变频柜进口水压力', 'db40_1450': '减速机1温度',
                             'db40_1454': '减速机2温度', 'db40_1458': '减速机3温度', 'db40_1462': '减速机4温度',
                             'db40_1466': '减速机5温度', 'db40_1470': '减速机6温度', 'db40_1486': '减速机10温度',
                             'db40_1490': '减速机11温度', 'db40_1494': '减速机12温度', 'db40_1526': '电机给定频率',
                             'db40_1530': '1#电机工作电流', 'db40_1534': '2#电机工作电流', 'db40_1538': '3#电机工作电流',
                             'db40_1542': '4#电机工作电流', 'db40_1546': '5#电机工作电流', 'db40_1550': '6#电机工作电流',
                             'db40_1554': '7#电机工作电流', 'db40_1558': '8#电机工作电流', 'db40_1570': '1#电机输出扭矩',
                             'db40_1574': '2#电机输出扭矩', 'db40_1578': '3#电机输出扭矩', 'db40_1582': '4#电机输出扭矩',
                             'db40_1586': '5#电机输出扭矩', 'db40_1590': '6#电机输出扭矩', 'db40_1594': '7#电机输出扭矩',
                             'db40_1598': '8#电机输出扭矩', 'db40_1610': '1#电机输出频率', 'db40_1614': '2#电机输出频率',
                             'db40_1618': '3#电机输出频率', 'db40_1622': '4#电机输出频率', 'db40_1626': '5#电机输出频率',
                             'db40_1630': '6#电机输出频率', 'db40_1634': '7#电机输出频率', 'db40_1638': '8#电机输出频率',
                             'db40_1802': '1#电机温度', 'db40_1806': '2#电机温度', 'db40_1810': '3#电机温度',
                             'db40_1814': '4#电机温度', 'db40_1818': '5#电机温度', 'db40_1822': '6#电机温度',
                             'db40_1826': '7#电机温度', 'db40_1830': '8#电机温度','db40_2150': '推进泵电机电流',
                             'db40_2154': '撑靴泵电机电流', 'db40_2158': '换步泵电机电流', 'db40_2170': '钢拱架泵电机电流',
                             'db40_2210': '左推进位移', 'db40_2214': '右推进位移', 'db40_2226': '左撑靴位移', 'db40_2230': '右撑靴位移',
                             'db40_2250': '推进泵压力', 'db40_2254': '控制油路压力', 'db40_2258': '辅助系统压力',
                             'db40_2266': '推进速度(m/H)', 'db40_2290': '循环冷却泵压力', 'db40_2294': '控制泵压力',
                             'db40_2298': '控制油路1压力', 'db40_2302': '1#换步泵压力', 'db40_2306': '撑靴泵压力',
                             'db40_2310': '2#换步泵压力', 'db40_2314': '钢拱架泵压力', 'db40_2318': '主皮带机泵压力',
                             'db40_2334': '主机皮带机速度', 'db40_2338': '后配套皮带机速度', 'db40_2366': 'C1皮带机泵电机电流',
                             'db40_2414': '主皮带机正转压力', 'db40_2418': '主皮带机反转压力', 'db40_2422': 'C2皮带机电机电流',
                             'db40_2450': '连续皮带机转速', 'db40_2930': '左侧护盾压力', 'db40_2934': '右侧护盾压力', 'db40_2938': '顶护盾压力',
                             'db40_2942': '左侧楔形油缸压力', 'db40_2946': '右侧楔形油缸压力', 'db40_2950': '左扭矩油缸伸出',
                             'db40_2954': '左扭矩油缸回收压力', 'db40_2958': '右扭矩油缸伸出压力', 'db40_2962': '右扭矩油缸回收压力',
                             'db40_2966': '左后支撑压力', 'db40_2970': '右后支撑压力', 'db40_2978': '左小腔撑靴压力',
                             'db40_2982': '右小腔撑靴压力', 'db40_2986': '撑紧压力', 'db40_2990': '左后支撑位移', 'db40_2994': '右后支撑位移',
                             'db40_3006': '左侧护盾位移', 'db40_3010': '右侧护盾位移', 'db40_3014': '左扭矩油缸位移',
                             'db40_3018': '右扭矩油缸位移', 'db40_3002': '顶护盾位移',  'db40_3730': '前部拖拉油缸压力',
                             'db40_3734': '后部拖拉油缸压力', 'db40_3738': '后左拖拉油缸位移', 'db40_3742': '后右拖拉油缸位移',
                             'db40_3810': '刀盘CH4', 'db40_3822': '主控室H2S', 'db40_3834': '主控室CO', 'db40_3838': '主控室CO2',
                             'db40_3830': '主控室O2', 'db40_3850': '出风口O2', 'db40_3866': '主机皮带机NO',
                             'db40_3870': '主机皮带机NO2', 'db40_3874': '主机皮带机CH4', 'db40_3890': '拖车尾部CH4',
                             'db40_4002': 'T1_L1相电压', 'db40_4006': 'T1_L2相电压', 'db40_4010': 'T1_L3相电压',
                             'db40_4026': 'T2_L1相电压', 'db40_4030': 'T2_L2相电压', 'db40_4034': 'T2_L3相电压',
                             'db40_4050': 'T3_L1相电压', 'db40_4054': 'T3_L2相电压', 'db40_4058': 'T3_L3相电压',
                             'db40_4014': 'T1_L1相电流', 'db40_4018': 'T1_L2相电流', 'db40_4022': 'T1_L3相电流',
                             'db40_4038': 'T2_L1相电流', 'db40_4042': 'T2_L2相电流', 'db40_4046': 'T2_L3相电流',
                             'db40_4062': 'T3_L1相电流', 'db40_4066': 'T3_L2相电流', 'db40_4070': 'T3_L3相电流',
                             'db40_4300': '齿轮油刀盘联锁剩余时间', 'db40_4302': '刀盘电机加热剩余时间', 'db42_60': '刀盘运行时间',
                             'db42_172': '液压循环过滤泵运行时间', 'db42_188': '液压循环冷却泵运行时间', 'db42_204': 'C1皮带机泵',
                             'db42_236': '换步泵运行时间', 'db42_252': '撑靴泵运行时间', 'db42_268': '推进泵运行时间',
                             'db42_284': '钢拱架泵运行时间', 'db42_396': 'L1左锚杆重击时间', 'db42_412': 'L1右锚杆重击时间',
                             'db47_100': '导向盾首Z', 'db47_104': '导向盾中X', 'db47_108': '导向盾中Y', 'db47_112': '导向盾中Z',
                             'db47_116': '导向盾尾X', 'db47_120': '导向盾尾Y', 'db47_124': '导向盾尾Z', 'db47_20': '导向盾中里程',
                             'db47_24': '导向盾尾里程', 'db47_68': '导向水平后', 'db47_72': '导向垂直后', 'db47_60': '导向水平中',
                             'db47_64': '导向垂直中', 'db47_52': '导向水平前', 'db47_56': '导向垂直前', 'db47_76': '导向水平趋向RP',
                             'db47_80': '导向垂直趋向RP', 'db47_92': '导向盾首X', 'db47_96': '导向盾首Y', 'db47_4': '导向滚动角',
                             'db47_0': '导向仰附角', 'db47_256': '导向掘进环数', 'db47_164': '1路盾尾间隙', 'db47_168': '2路盾尾间隙',
                             'db47_172': '3路盾尾间隙', 'db47_176': '4路盾尾间隙', 'db47_180': '5路盾尾间隙', 'db47_184': '6路盾尾间隙',
                             'db47_188': '7路盾尾间隙', 'db47_192': '8路盾尾间隙', 'db43_210': '始发里程设置', 'db43_214': '终止里程设置',
                             'db43_218': '上月起始里程设置', 'db43_222': '本月起始里程设置', 'db43_254': '电压偏差报警值设置',
                             'db43_258': '电压偏差极限值设置', 'db43_530': '主油箱温度报警设定值', 'db43_534': '主油箱温度停机设定值',
                             'db43_538': '温度误差设定值', 'db43_542': '暖水箱自动排水温度设置', 'db43_546': '二次风机频率设置',
                             'db43_570': '电机温度报警设定值', 'db43_930': '齿轮油温度报警设定值', 'db43_934': '齿轮油温度停机设定值',
                             'db43_950': '外密封迷宫油脂次数报警设定值', 'db43_954': '外密封迷宫油脂次数停机设定值',
                             'db43_958': '外密封前腔油脂次数报警设定值', 'db43_962': '外密封前腔油脂次数停机设定值',
                             'db43_966': '内密封迷宫油脂次数报警设定值', 'db43_970': '内密封迷宫油脂次数停机设定值',
                             'db43_974': '内密封前腔油脂次数报警设定值', 'db43_978': '内密封前腔油脂次数停机设定值',
                             'db43_990': 'EP2压力设置', 'db43_994': 'EP2频率设置', 'db43_1450': '刀盘最低转速设置',
                             'db43_1454': '最大允许贯入度设置', 'db43_2190': '推进泵压力设置', 'db43_2246': '撑靴压力设定',
                             'db43_3742': '拖拉油缸最大允许压力设置', 'db43_3746': '拖拉油缸最小允许压力设置',
                             'db973_2': '设备编号', 'db973_4': '里程整数', 'db973_8': '里程小数', 'db973_12': '累计掘进长度',
                             'db973_16': '当前环号', 'db973_20': '前点水平偏差', 'db973_24': '前点垂直偏差',
                             'db973_28': '后点水平偏差', 'db973_32': '后点垂直偏差', 'db973_36': '水平倾向',
                             'db973_40': '竖直倾向', 'db973_44': '前盾俯仰角', 'db973_48': '前盾滚动角', 'db973_52': '尾盾俯仰角',
                             'db973_56': '尾盾滚动角', 'db973_60': '切口环中心点绝对坐标X整数', 'db973_64': '切口环中心点绝对坐标X小数',
                             'db973_68': '切口环中心点绝对坐标Y整数', 'db973_72': '切口环中心点绝对坐标Y小数',
                             'db973_76': '切口环中心点绝对坐标Z整数', 'db973_80': '切口环中心点绝对坐标Z小数',
                             'db973_84': '盾尾中心点绝对坐标X整数', 'db973_88': '盾尾中心点绝对坐标X小数',
                             'db973_92': '盾尾中心点绝对坐标Y整数', 'db973_96': '盾尾中心点绝对坐标Y小数',
                             'db973_100': '盾尾中心点绝对坐标Z整数', 'db973_104': '盾尾中心点绝对坐标Z小数', 'db973_116': '贯入度',
                             'db973_120': '刀盘功率', 'db973_124': '刀盘转速电位计设定值', 'db973_136': '总推进力',
                             'db973_140': '推进速度电位计设定值', 'db973_144': '撑靴压力', 'db973_168': '左下撑靴位移',
                             'db973_172': '右下撑靴位移', 'db973_184': '左护盾压力', 'db973_188': '左护盾位移',
                             'db973_192': '右护盾压力', 'db973_196': '右护盾位移', 'db973_200': '左楔形块油缸压力',
                             'db973_204': '右楔形块油缸压力', 'db973_208': 'C1皮带机转速', 'db973_212': 'C1泵电机电流',
                             'db973_216': 'C2皮带机转速', 'db973_220': 'C2泵电机电流',  'db973_300': '抗压强度', 'db973_304': '完整性',
                             'db973_312': '掘进速度建议值', 'db973_316': '刀盘转速建议值', 'db973_320': '贯入度建议值', 'db973_324': '推力建议值',
                             'db973_328': '总扭矩建议值', 'db973_332': '传感器1振动均方幅值', 'db973_336': '传感器1振动烈度',
                             'db973_340': '传感器1振动峭度', 'db973_344': '传感器1振动峰值', 'db973_348': '传感器1采样频率',
                             'db973_352': '传感器2振动均方幅值', 'db973_356': '传感器2振动烈度', 'db973_360': '传感器2振动峭度',
                             'db973_364': '传感器2振动峰值', 'db973_368': '传感器2采样频率', 'db973_372': '传感器3振动均方幅值',
                             'db973_376': '传感器3振动烈度', 'db973_380': '传感器3振动峭度', 'db973_384': '传感器3振动峰值',
                             'db973_388': '传感器3采样频率', 'db973_392': '渣片粒径统计特征1', 'db973_396': '渣片粒径统计特征2',
                             'db973_400': '渣片粒径统计特征3', 'db973_404': '渣片粒径统计特征4', 'db973_408': '渣片粒径统计特征5',
                             'db973_412': '渣片粒径统计特征6', 'db973_416': '渣片粒径统计特征7', 'db973_420': '水平趋势补偿',
                             'db973_424': '竖直趋势补偿', 'db973_428': '预计用时', 'db973_432': '预计里程',
                             'db973_436': '左推进油缸行程建议值', 'db973_440': '右推进油缸行程建议值', 'db973_444': '左撑靴油缸行程建议值',
                             'db973_448': '右撑靴油缸行程建议值', 'db973_452': '趋向调节水平建议值', 'db973_456': '趋向调节竖直建议值',
                             'db973_460': '趋向调节滚转建议值', 'db973_464': '预测拱架规格', 'db973_468': '预测拱架间距'}
        self.PLC_Practical_URL = 'http://127.0.0.1:8800/api/realtime?id=3'
        self.Key_Practical = {'time_str': '运行时间', 'db47_16': '导向盾首里程', 'db973_308': '围岩等级', 'db40_1330': '刀盘转速',
                              'db40_1514': '刀盘给定转速',  'db40_2138': '推进速度(nn/M)', 'db40_2262': '推进给定速度',
                              'db40_1346': '刀盘扭矩', 'db40_2134': '总推力', 'db40_1518': '刀盘贯入度', 'db40_2142': '推进位移',
                              'db40_2130': '推进压力', 'db40_230': '日进尺', 'db40_234': '本月进尺', 'db40_238': '上月进尺',
                              'db40_242': '开累进尺', 'db40_246': '隧道总长度', 'db40_250': '完成百分比', 'db40_530': '内循环水罐进口水温度',
                              'db40_534': '内循环水出口温度', 'db40_538': '冷水箱温度', 'db40_542': '冷水箱液位', 'db40_546': '暖水箱温度',
                              'db40_550': '暖水箱液位', 'db40_562': '水系统进水流量', 'db40_566': '液压油箱温度', 'db40_570': '进水温度',
                              'db40_574': '冷水泵出口水温度', 'db40_582': '水系统进水压力', 'db40_586': '污水箱液位', 'db40_590': '减速机进水压力',
                              'db40_594': '减速机回水温度', 'db40_598': '护盾喷水压力', 'db40_602': '刀盘喷水压力', 'db40_962': 'EP2次数',
                              'db40_610': '减速机冷却水出口流量', 'db40_614': '锚杆钻机冷却冲洗泵压力', 'db40_650': '备用水泵压力',
                              'db40_654': '冷水泵压力', 'db40_658': '内循环水泵出口压力', 'db40_670': '刀盘喷水泵压力', 'db40_1082': '小轴承润滑',
                              'db40_718': '二次风机2电机电流', 'db40_722': '二次风机1电机电流', 'db40_930': '齿轮油箱温度',
                              'db40_954': 'EP2出口压力', 'db40_958': '油脂泵出口压力', 'db40_966': '内密封前腔压力',
                              'db40_970': '外密封迷宫腔压力', 'db40_974': '外密封前腔压力', 'db40_978': '内密封迷宫腔压力',
                              'db40_982': '内密封前腔注脂频率', 'db40_986': '外密封迷宫腔注脂频率', 'db40_990': '外密封前腔注脂频率',
                              'db40_1002': '齿轮油泵1压力', 'db40_1006': '齿轮油泵2压力', 'db40_1010': '齿轮油泵3压力',
                              'db40_1026': '回油泵压力', 'db40_1050': '润滑泵电机电流', 'db40_1054': '推进油缸前部铰接',
                              'db40_1058': '推进油缸后部铰接', 'db40_1062': '撑靴球头滑轨', 'db40_1066': '推进右后及行走轨润滑注脂频率',
                              'db40_1070': '扭矩油缸铰接润滑注脂频率', 'db40_1078': '小齿轮润滑', 'db40_934': '回油泵进口温度',
                              'db40_1086': '主轴承润滑1', 'db40_1090': '主轴承润滑2', 'db40_1118': '提升油缸十字铰接次数',
                              'db40_1122': '护盾铰接次数', 'db40_1246': '喷浆泵压力', 'db40_1250': '机械手泵电机电流',
                              'db40_1342': '刹车释放压力', 'db40_1422': '刀盘运行时间小时', 'db40_1426': '刀盘运行时间分钟',
                              'db40_1430': '变频柜内水温度', 'db40_1434': '变频柜进口水压力', 'db40_1450': '减速机1温度',
                              'db40_1454': '减速机2温度', 'db40_1458': '减速机3温度', 'db40_1462': '减速机4温度',
                              'db40_1466': '减速机5温度', 'db40_1470': '减速机6温度', 'db40_1486': '减速机10温度',
                              'db40_1490': '减速机11温度', 'db40_1494': '减速机12温度', 'db40_1526': '电机给定频率',
                              'db40_1530': '1#电机工作电流', 'db40_1534': '2#电机工作电流', 'db40_1538': '3#电机工作电流',
                              'db40_1542': '4#电机工作电流', 'db40_1546': '5#电机工作电流', 'db40_1550': '6#电机工作电流',
                              'db40_1554': '7#电机工作电流', 'db40_1558': '8#电机工作电流', 'db40_1570': '1#电机输出扭矩',
                              'db40_1574': '2#电机输出扭矩', 'db40_1578': '3#电机输出扭矩', 'db40_1582': '4#电机输出扭矩',
                              'db40_1586': '5#电机输出扭矩', 'db40_1590': '6#电机输出扭矩', 'db40_1594': '7#电机输出扭矩',
                              'db40_1598': '8#电机输出扭矩', 'db40_1610': '1#电机输出频率', 'db40_1614': '2#电机输出频率',
                              'db40_1618': '3#电机输出频率', 'db40_1622': '4#电机输出频率', 'db40_1626': '5#电机输出频率',
                              'db40_1630': '6#电机输出频率', 'db40_1634': '7#电机输出频率', 'db40_1638': '8#电机输出频率',
                              'db40_1802': '1#电机温度', 'db40_1806': '2#电机温度', 'db40_1810': '3#电机温度',
                              'db40_1814': '4#电机温度', 'db40_1818': '5#电机温度', 'db40_1822': '6#电机温度',
                              'db40_1826': '7#电机温度', 'db40_1830': '8#电机温度', 'db40_2150': '推进泵电机电流',
                              'db40_2154': '撑靴泵电机电流', 'db40_2158': '换步泵电机电流', 'db40_2170': '钢拱架泵电机电流',
                              'db40_2210': '左推进位移', 'db40_2214': '右推进位移', 'db40_2226': '左撑靴位移', 'db40_2230': '右撑靴位移',
                              'db40_2250': '推进泵压力', 'db40_2254': '控制油路压力', 'db40_2258': '辅助系统压力',
                              'db40_2266': '推进速度(m/H)', 'db40_2290': '循环冷却泵压力', 'db40_2294': '控制泵压力',
                              'db40_2298': '控制油路1压力', 'db40_2302': '1#换步泵压力', 'db40_2306': '撑靴泵压力',
                              'db40_2310': '2#换步泵压力', 'db40_2314': '钢拱架泵压力', 'db40_2318': '主皮带机泵压力',
                              'db40_2334': '主机皮带机速度', 'db40_2338': '后配套皮带机速度', 'db40_2366': 'C1皮带机泵电机电流',
                              'db40_2414': '主皮带机正转压力', 'db40_2418': '主皮带机反转压力', 'db40_2422': 'C2皮带机电机电流',
                              'db40_2450': '连续皮带机转速', 'db40_2930': '左侧护盾压力', 'db40_2934': '右侧护盾压力',
                              'db40_2942': '左侧楔形油缸压力', 'db40_2946': '右侧楔形油缸压力', 'db40_2950': '左扭矩油缸伸出',
                              'db40_2954': '左扭矩油缸回收压力', 'db40_2958': '右扭矩油缸伸出压力', 'db40_2962': '右扭矩油缸回收压力',
                              'db40_2966': '左后支撑压力', 'db40_2970': '右后支撑压力', 'db40_2978': '左小腔撑靴压力',
                              'db40_2982': '右小腔撑靴压力', 'db40_2986': '撑紧压力', 'db40_2990': '左后支撑位移', 'db40_2994': '右后支撑位移',
                              'db40_3006': '左侧护盾位移', 'db40_3010': '右侧护盾位移', 'db40_3014': '左扭矩油缸位移',
                              'db40_3018': '右扭矩油缸位移', 'db40_3002': '顶护盾位移',  'db40_3730': '前部拖拉油缸压力',
                              'db40_3734': '后部拖拉油缸压力', 'db40_3738': '后左拖拉油缸位移', 'db40_3742': '后右拖拉油缸位移',
                              'db40_3810': '刀盘CH4', 'db40_3822': '主控室H2S', 'db40_3834': '主控室CO', 'db40_3838': '主控室CO2',
                              'db40_3830': '主控室O2', 'db40_3850': '出风口O2', 'db40_3866': '主机皮带机NO', 'db40_2938': '顶护盾压力',
                              'db40_3870': '主机皮带机NO2', 'db40_3874': '主机皮带机CH4', 'db40_3890': '拖车尾部CH4',
                              'db40_4002': 'T1_L1相电压', 'db40_4006': 'T1_L2相电压', 'db40_4010': 'T1_L3相电压',
                              'db40_4026': 'T2_L1相电压', 'db40_4030': 'T2_L2相电压', 'db40_4034': 'T2_L3相电压',
                              'db40_4050': 'T3_L1相电压', 'db40_4054': 'T3_L2相电压', 'db40_4058': 'T3_L3相电压',
                              'db40_4014': 'T1_L1相电流', 'db40_4018': 'T1_L2相电流', 'db40_4022': 'T1_L3相电流',
                              'db40_4038': 'T2_L1相电流', 'db40_4042': 'T2_L2相电流', 'db40_4046': 'T2_L3相电流',
                              'db40_4062': 'T3_L1相电流', 'db40_4066': 'T3_L2相电流', 'db40_4070': 'T3_L3相电流',
                              'db40_4300': '齿轮油刀盘联锁剩余时间', 'db40_4302': '刀盘电机加热剩余时间', 'db42_60': '刀盘运行时间',
                              'db42_172': '液压循环过滤泵运行时间', 'db42_188': '液压循环冷却泵运行时间', 'db42_204': 'C1皮带机泵',
                              'db42_236': '换步泵运行时间', 'db42_252': '撑靴泵运行时间', 'db42_268': '推进泵运行时间',
                              'db42_284': '钢拱架泵运行时间', 'db42_396': 'L1左锚杆重击时间', 'db42_412': 'L1右锚杆重击时间',
                              'db47_100': '导向盾首Z', 'db47_104': '导向盾中X', 'db47_108': '导向盾中Y', 'db47_112': '导向盾中Z',
                              'db47_116': '导向盾尾X', 'db47_120': '导向盾尾Y', 'db47_124': '导向盾尾Z', 'db47_20': '导向盾中里程',
                              'db47_24': '导向盾尾里程', 'db47_68': '导向水平后', 'db47_72': '导向垂直后', 'db47_60': '导向水平中',
                              'db47_64': '导向垂直中', 'db47_52': '导向水平前', 'db47_56': '导向垂直前', 'db47_76': '导向水平趋向RP',
                              'db47_80': '导向垂直趋向RP', 'db47_92': '导向盾首X', 'db47_96': '导向盾首Y', 'db47_4': '导向滚动角',
                              'db47_0': '导向仰附角', 'db47_256': '导向掘进环数', 'db47_164': '1路盾尾间隙', 'db47_168': '2路盾尾间隙',
                              'db47_172': '3路盾尾间隙', 'db47_176': '4路盾尾间隙', 'db47_180': '5路盾尾间隙', 'db47_184': '6路盾尾间隙',
                              'db47_188': '7路盾尾间隙', 'db47_192': '8路盾尾间隙', 'db43_210': '始发里程设置', 'db43_214': '终止里程设置',
                              'db43_218': '上月起始里程设置', 'db43_222': '本月起始里程设置', 'db43_254': '电压偏差报警值设置',
                              'db43_258': '电压偏差极限值设置', 'db43_530': '主油箱温度报警设定值', 'db43_534': '主油箱温度停机设定值',
                              'db43_538': '温度误差设定值', 'db43_542': '暖水箱自动排水温度设置', 'db43_546': '二次风机频率设置',
                              'db43_570': '电机温度报警设定值', 'db43_930': '齿轮油温度报警设定值', 'db43_934': '齿轮油温度停机设定值',
                              'db43_950': '外密封迷宫油脂次数报警设定值', 'db43_954': '外密封迷宫油脂次数停机设定值',
                              'db43_958': '外密封前腔油脂次数报警设定值', 'db43_962': '外密封前腔油脂次数停机设定值',
                              'db43_966': '内密封迷宫油脂次数报警设定值', 'db43_970': '内密封迷宫油脂次数停机设定值',
                              'db43_974': '内密封前腔油脂次数报警设定值', 'db43_978': '内密封前腔油脂次数停机设定值',
                              'db43_990': 'EP2压力设置', 'db43_994': 'EP2频率设置', 'db43_1450': '刀盘最低转速设置',
                              'db43_1454': '最大允许贯入度设置', 'db43_2190': '推进泵压力设置', 'db43_2246': '撑靴压力设定',
                              'db43_3742': '拖拉油缸最大允许压力设置', 'db43_3746': '拖拉油缸最小允许压力设置',
                              'db973_2': '设备编号', 'db973_4': '里程整数', 'db973_8': '里程小数', 'db973_12': '累计掘进长度',
                              'db973_16': '当前环号', 'db973_20': '前点水平偏差', 'db973_24': '前点垂直偏差',
                              'db973_28': '后点水平偏差', 'db973_32': '后点垂直偏差', 'db973_36': '水平倾向',
                              'db973_40': '竖直倾向', 'db973_44': '前盾俯仰角', 'db973_48': '前盾滚动角', 'db973_52': '尾盾俯仰角',
                              'db973_56': '尾盾滚动角', 'db973_60': '切口环中心点绝对坐标X整数', 'db973_64': '切口环中心点绝对坐标X小数',
                              'db973_68': '切口环中心点绝对坐标Y整数', 'db973_72': '切口环中心点绝对坐标Y小数',
                              'db973_76': '切口环中心点绝对坐标Z整数', 'db973_80': '切口环中心点绝对坐标Z小数',
                              'db973_84': '盾尾中心点绝对坐标X整数', 'db973_88': '盾尾中心点绝对坐标X小数', 'db973_324': '推力建议值',
                              'db973_92': '盾尾中心点绝对坐标Y整数', 'db973_96': '盾尾中心点绝对坐标Y小数',
                              'db973_100': '盾尾中心点绝对坐标Z整数', 'db973_104': '盾尾中心点绝对坐标Z小数', 'db973_116': '贯入度',
                              'db973_120': '刀盘功率', 'db973_124': '刀盘转速电位计设定值', 'db973_136': '总推进力',
                              'db973_140': '推进速度电位计设定值', 'db973_144': '撑靴压力', 'db973_168': '左下撑靴位移',
                              'db973_172': '右下撑靴位移', 'db973_184': '左护盾压力', 'db973_188': '左护盾位移',
                              'db973_192': '右护盾压力', 'db973_196': '右护盾位移', 'db973_200': '左楔形块油缸压力',
                              'db973_204': '右楔形块油缸压力', 'db973_208': 'C1皮带机转速', 'db973_212': 'C1泵电机电流',
                              'db973_216': 'C2皮带机转速', 'db973_220': 'C2泵电机电流',  'db973_300': '抗压强度', 'db973_304': '完整性',
                              'db973_312': '掘进速度建议值', 'db973_316': '刀盘转速建议值', 'db973_320': '贯入度建议值',
                              'db973_328': '总扭矩建议值', 'db973_332': '传感器1振动均方幅值', 'db973_336': '传感器1振动烈度',
                              'db973_340': '传感器1振动峭度', 'db973_344': '传感器1振动峰值', 'db973_348': '传感器1采样频率',
                              'db973_352': '传感器2振动均方幅值', 'db973_356': '传感器2振动烈度', 'db973_360': '传感器2振动峭度',
                              'db973_364': '传感器2振动峰值', 'db973_368': '传感器2采样频率', 'db973_372': '传感器3振动均方幅值',
                              'db973_376': '传感器3振动烈度', 'db973_380': '传感器3振动峭度', 'db973_384': '传感器3振动峰值',
                              'db973_388': '传感器3采样频率', 'db973_392': '渣片粒径统计特征1', 'db973_396': '渣片粒径统计特征2',
                              'db973_400': '渣片粒径统计特征3', 'db973_404': '渣片粒径统计特征4', 'db973_408': '渣片粒径统计特征5',
                              'db973_412': '渣片粒径统计特征6', 'db973_416': '渣片粒径统计特征7', 'db973_420': '水平趋势补偿',
                              'db973_424': '竖直趋势补偿', 'db973_428': '预计用时', 'db973_432': '预计里程',
                              'db973_436': '左推进油缸行程建议值', 'db973_440': '右推进油缸行程建议值', 'db973_444': '左撑靴油缸行程建议值',
                              'db973_448': '右撑靴油缸行程建议值', 'db973_452': '趋向调节水平建议值', 'db973_456': '趋向调节竖直建议值',
                              'db973_460': '趋向调节滚转建议值', 'db973_464': '预测拱架规格', 'db973_468': '预测拱架间距'}
        self.Raw_Data = DataFrame()

    def run(self, Type='YS') -> [DataFrame, bool]:
        """
        将第原始数据读取相关代码放置在这里
        :param Type: 'YS'、'YC'、'PLC'
        :return: 每秒数据（per_data）, PLC状态（True/False）
        """
        if Type == 'YS':
            return self.Read_YS_Data()  # 返回每秒数据，请勿修改，数据格式为 DataFrame
        elif Type == 'YC':
            return self.Read_YC_Data()  # 返回每秒数据，请勿修改，数据格式为 DataFrame
        elif Type == 'S-PLC':
            return self.Read_Simulate_PLC_Data()  # 返回每秒数据，请勿修改，数据格式为 DataFrame
        elif Type == 'P-PLC':
            return self.Read_Practical_PLC_Data()  # 返回每秒数据，请勿修改，数据格式为 DataFrame
        else:
            print('选项不存在')
            return DataFrame()

    def Read_Simulate_PLC_Data(self):
        try:
            html = urllib.request.urlopen(self.PLC_Simulate_URL, timeout=0.5)
            data = json.loads(html.read())  # json格式解析
            per_data = pd.DataFrame([data])
            per_data.rename(columns=self.Key_Simulate, inplace=True)
            per_data.rename(columns=self.Key_YC, inplace=True)
            return per_data.loc[0, :], True
        except urllib.error.URLError:
            return DataFrame(), False

    def Read_Practical_PLC_Data(self):
        try:
            html = urllib.request.urlopen(self.PLC_Simulate_URL, timeout=0.5)
            data = json.loads(html.read())  # json格式解析
            per_data = pd.DataFrame([data["items"]])
            per_data["time_str"] = data["time_str"]
            per_data = per_data[self.Key_Practical.keys()]
            per_data.rename(columns=self.Key, inplace=True)
            return per_data.loc[0, :], True
        except Exception as e:
            return DataFrame(), False

    def Read_YS_Data(self):
        if os.path.exists(self.YS_Resource):
            self.YS_csv_list = os.listdir(self.YS_Resource)
            if self.Raw_Data.empty or self.YS_csv_col > self.Raw_Data.shape[0] - 1:
                csv_path = os.path.join(self.YS_Resource, self.YS_csv_list[self.YS_csv_num])
                self.Raw_Data = pd.read_csv(csv_path, encoding='gb2312')

                a = self.Raw_Data.loc[:, '左侧护盾位移'].to_frame()
                a.rename(columns={'左侧护盾位移': '顶护盾位移'}, inplace=True)
                self.Raw_Data = pd.concat([self.Raw_Data, a], axis=1)

                self.Raw_Data.rename(columns=self.Key_YS, inplace=True)
                self.YS_csv_num += 1
                self.YS_csv_col = 0
            per_data = self.Raw_Data.loc[self.YS_csv_col, :]
            self.YS_csv_col += 1
            return per_data, True
        else:
            print('路径 %s 不存在' % self.YS_Resource)
            return DataFrame(), False

    def Read_YC_Data(self):
        if os.path.exists(self.YC_Resource):
            self.YC_csv_list = os.listdir(self.YC_Resource)
            if self.Raw_Data.empty or self.YC_csv_col > self.Raw_Data.shape[0] - 1:
                csv_path = os.path.join(self.YC_Resource, self.YC_csv_list[self.YC_csv_num])
                self.Raw_Data = pd.read_csv(csv_path, encoding='gb2312')
                self.Raw_Data = self.Raw_Data.drop('推进速度', axis=1)
                self.Raw_Data.rename(columns=self.Key_YC, inplace=True)
                self.YC_csv_num += 1
                self.YC_csv_col = 0
            per_data = self.Raw_Data.loc[self.YC_csv_col, :]
            self.YC_csv_col += 1
            return per_data, True
        else:
            print('路径 %s 不存在' % self.YC_Resource)
            return DataFrame(), False


def my_func():
    global time_start
    try:
        print(a.run()[0])
    except Exception as e:
        print(e)
    time_end = time.time()
    print(int((time_end - time_start) * 100) / 100)
    time_start = time.time()


if __name__ == '__main__':
    a = DataInput()
    time_start = time.time()
    app = QApplication([])
    timer = QTimer()
    timer.timeout.connect(my_func)
    timer.start(1000)  # 每隔1000ms（1秒）调用一次my_func()
    app.exec_()
